Ran Plan for 6 projects:

1. dir: `nz3es/gcp/prd/data-plane/australia-southeast2/network` workspace: `nz3es_gcp_prd_data-plane_australia-southeast2_network`
1. dir: `nz3es/gcp/stg/data-plane/australia-southeast2/network` workspace: `nz3es_gcp_stg_data-plane_australia-southeast2_network`
1. dir: `nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-example-com` workspace: `nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-example-com`
1. dir: `nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-example-com` workspace: `nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-example-com`
1. dir: `nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-internal` workspace: `nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-internal`
1. dir: `nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-internal` workspace: `nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-internal`
---

### 1. dir: `nz3es/gcp/prd/data-plane/australia-southeast2/network` workspace: `nz3es_gcp_prd_data-plane_australia-southeast2_network`
<details><summary>Show Output</summary>

```diff
Workspace directory /home/atlantis/data/repos/iac/7/nz3es_gcp_prd_data-plane_australia-southeast2_network does not exist yet, skipping cache cleanup

22:06:02.835 INFO   Downloading Terraform configurations from ../../../../../../modules/vpc into ./.terragrunt-cache/t2J3wXNRGI3IOhb4XawfK3KE7mw/28HYrGdFm5aFtt_oaBnmGjyDXHE
22:06:02.880 INFO   terraform1.13.3: Initializing the backend...
22:06:03.753 INFO   terraform1.13.3: 
22:06:03.753 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
22:06:03.753 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
22:06:04.049 INFO   terraform1.13.3: Initializing provider plugins...
22:06:04.049 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
22:06:04.341 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
22:06:04.663 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
22:06:04.663 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
22:06:04.663 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
22:06:04.663 INFO   terraform1.13.3: you run "terraform init" in the future.
22:06:04.663 INFO   terraform1.13.3: ╷
22:06:04.663 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
22:06:04.663 INFO   terraform1.13.3: │ 
22:06:04.664 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
22:06:04.664 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
22:06:04.664 INFO   terraform1.13.3: │   - hashicorp/google
22:06:04.664 INFO   terraform1.13.3: │ 
22:06:04.664 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
22:06:04.664 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
22:06:04.664 INFO   terraform1.13.3: │ these providers.
22:06:04.664 INFO   terraform1.13.3: │ 
22:06:04.664 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
22:06:04.664 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
22:06:04.664 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
22:06:04.664 INFO   terraform1.13.3: ╵
22:06:04.664 INFO   terraform1.13.3: Terraform has been successfully initialized!
22:06:07.813 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
22:06:07.813 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
22:06:07.814 STDOUT terraform1.13.3:   + create
22:06:07.814 STDOUT terraform1.13.3: Terraform will perform the following actions:
22:06:07.815 STDOUT terraform1.13.3:   # google_compute_network.vpc_network will be created
22:06:07.815 STDOUT terraform1.13.3:   + resource "google_compute_network" "vpc_network" {
22:06:07.816 STDOUT terraform1.13.3:       + auto_create_subnetworks                   = false
22:06:07.816 STDOUT terraform1.13.3:       + bgp_always_compare_med                    = (known after apply)
22:06:07.817 STDOUT terraform1.13.3:       + bgp_best_path_selection_mode              = (known after apply)
22:06:07.817 STDOUT terraform1.13.3:       + bgp_inter_region_cost                     = (known after apply)
22:06:07.818 STDOUT terraform1.13.3:       + delete_bgp_always_compare_med             = false
22:06:07.818 STDOUT terraform1.13.3:       + delete_default_routes_on_create           = false
22:06:07.819 STDOUT terraform1.13.3:       + gateway_ipv4                              = (known after apply)
22:06:07.819 STDOUT terraform1.13.3:       + id                                        = (known after apply)
22:06:07.819 STDOUT terraform1.13.3:       + internal_ipv6_range                       = (known after apply)
22:06:07.820 STDOUT terraform1.13.3:       + mtu                                       = (known after apply)
22:06:07.820 STDOUT terraform1.13.3:       + name                                      = "prd-vpc-australia-southeast2"
22:06:07.820 STDOUT terraform1.13.3:       + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
22:06:07.821 STDOUT terraform1.13.3:       + network_id                                = (known after apply)
22:06:07.821 STDOUT terraform1.13.3:       + numeric_id                                = (known after apply)
22:06:07.821 STDOUT terraform1.13.3:       + project                                   = "iac-01"
22:06:07.821 STDOUT terraform1.13.3:       + routing_mode                              = (known after apply)
22:06:07.821 STDOUT terraform1.13.3:       + self_link                                 = (known after apply)
22:06:07.821 STDOUT terraform1.13.3:     }
22:06:07.821 STDOUT terraform1.13.3:   # google_compute_subnetwork.subnet will be created
22:06:07.822 STDOUT terraform1.13.3:   + resource "google_compute_subnetwork" "subnet" {
22:06:07.822 STDOUT terraform1.13.3:       + creation_timestamp         = (known after apply)
22:06:07.822 STDOUT terraform1.13.3:       + external_ipv6_prefix       = (known after apply)
22:06:07.822 STDOUT terraform1.13.3:       + fingerprint                = (known after apply)
22:06:07.822 STDOUT terraform1.13.3:       + gateway_address            = (known after apply)
22:06:07.822 STDOUT terraform1.13.3:       + id                         = (known after apply)
22:06:07.822 STDOUT terraform1.13.3:       + internal_ipv6_prefix       = (known after apply)
22:06:07.822 STDOUT terraform1.13.3:       + ip_cidr_range              = "10.0.0.0/24"
22:06:07.822 STDOUT terraform1.13.3:       + ipv6_cidr_range            = (known after apply)
22:06:07.822 STDOUT terraform1.13.3:       + ipv6_gce_endpoint          = (known after apply)
22:06:07.822 STDOUT terraform1.13.3:       + name                       = "prd-vpc-australia-southeast2-subnet"
22:06:07.823 STDOUT terraform1.13.3:       + network                    = (known after apply)
22:06:07.823 STDOUT terraform1.13.3:       + private_ip_google_access   = (known after apply)
22:06:07.823 STDOUT terraform1.13.3:       + private_ipv6_google_access = (known after apply)
22:06:07.823 STDOUT terraform1.13.3:       + project                    = "iac-01"
22:06:07.823 STDOUT terraform1.13.3:       + purpose                    = (known after apply)
22:06:07.823 STDOUT terraform1.13.3:       + region                     = "australia-southeast2"
22:06:07.823 STDOUT terraform1.13.3:       + self_link                  = (known after apply)
22:06:07.823 STDOUT terraform1.13.3:       + stack_type                 = (known after apply)
22:06:07.824 STDOUT terraform1.13.3:       + state                      = (known after apply)
22:06:07.824 STDOUT terraform1.13.3:       + subnetwork_id              = (known after apply)
22:06:07.824 STDOUT terraform1.13.3:       + secondary_ip_range (known after apply)
22:06:07.824 STDOUT terraform1.13.3:     }
22:06:07.824 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
22:06:07.824 STDOUT terraform1.13.3: 
22:06:07.824 STDOUT terraform1.13.3: Changes to Outputs:
22:06:07.824 STDOUT terraform1.13.3:   + network_id        = (known after apply)
22:06:07.824 STDOUT terraform1.13.3:   + network_self_link = (known after apply)
22:06:07.824 STDOUT terraform1.13.3:   + subnet_self_link  = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/prd/data-plane/australia-southeast2/network -w nz3es_gcp_prd_data-plane_australia-southeast2_network
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fprd%252Fdata-plane%252Faustralia-southeast2%252Fnetwork%252Fnz3es_gcp_prd_data-plane_australia-southeast2_network)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/prd/data-plane/australia-southeast2/network -w nz3es_gcp_prd_data-plane_australia-southeast2_network
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `nz3es/gcp/stg/data-plane/australia-southeast2/network` workspace: `nz3es_gcp_stg_data-plane_australia-southeast2_network`
<details><summary>Show Output</summary>

```diff
Workspace directory /home/atlantis/data/repos/iac/7/nz3es_gcp_stg_data-plane_australia-southeast2_network does not exist yet, skipping cache cleanup

22:06:02.826 INFO   Downloading Terraform configurations from ../../../../../../modules/vpc into ./.terragrunt-cache/Oc9yukbBQth78rcMZo73cG0RflM/Ju94PBdi0zCaL_R-zIqUFdRVoIk
22:06:02.874 INFO   terraform1.13.3: Initializing the backend...
22:06:03.699 INFO   terraform1.13.3: 
22:06:03.699 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
22:06:03.699 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
22:06:04.001 INFO   terraform1.13.3: Initializing provider plugins...
22:06:04.001 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
22:06:04.342 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
22:06:04.663 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
22:06:04.663 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
22:06:04.663 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
22:06:04.663 INFO   terraform1.13.3: you run "terraform init" in the future.
22:06:04.663 INFO   terraform1.13.3: ╷
22:06:04.663 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
22:06:04.663 INFO   terraform1.13.3: │ 
22:06:04.663 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
22:06:04.663 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
22:06:04.663 INFO   terraform1.13.3: │   - hashicorp/google
22:06:04.663 INFO   terraform1.13.3: │ 
22:06:04.663 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
22:06:04.663 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
22:06:04.664 INFO   terraform1.13.3: │ these providers.
22:06:04.664 INFO   terraform1.13.3: │ 
22:06:04.664 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
22:06:04.664 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
22:06:04.664 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
22:06:04.664 INFO   terraform1.13.3: ╵
22:06:04.664 INFO   terraform1.13.3: Terraform has been successfully initialized!
22:06:07.825 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
22:06:07.826 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
22:06:07.826 STDOUT terraform1.13.3:   + create
22:06:07.826 STDOUT terraform1.13.3: Terraform will perform the following actions:
22:06:07.826 STDOUT terraform1.13.3:   # google_compute_network.vpc_network will be created
22:06:07.827 STDOUT terraform1.13.3:   + resource "google_compute_network" "vpc_network" {
22:06:07.827 STDOUT terraform1.13.3:       + auto_create_subnetworks                   = false
22:06:07.827 STDOUT terraform1.13.3:       + bgp_always_compare_med                    = (known after apply)
22:06:07.827 STDOUT terraform1.13.3:       + bgp_best_path_selection_mode              = (known after apply)
22:06:07.827 STDOUT terraform1.13.3:       + bgp_inter_region_cost                     = (known after apply)
22:06:07.827 STDOUT terraform1.13.3:       + delete_bgp_always_compare_med             = false
22:06:07.827 STDOUT terraform1.13.3:       + delete_default_routes_on_create           = false
22:06:07.827 STDOUT terraform1.13.3:       + gateway_ipv4                              = (known after apply)
22:06:07.828 STDOUT terraform1.13.3:       + id                                        = (known after apply)
22:06:07.828 STDOUT terraform1.13.3:       + internal_ipv6_range                       = (known after apply)
22:06:07.828 STDOUT terraform1.13.3:       + mtu                                       = (known after apply)
22:06:07.828 STDOUT terraform1.13.3:       + name                                      = "stg-vpc-australia-southeast2"
22:06:07.828 STDOUT terraform1.13.3:       + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
22:06:07.828 STDOUT terraform1.13.3:       + network_id                                = (known after apply)
22:06:07.829 STDOUT terraform1.13.3:       + numeric_id                                = (known after apply)
22:06:07.829 STDOUT terraform1.13.3:       + project                                   = "iac-01"
22:06:07.829 STDOUT terraform1.13.3:       + routing_mode                              = (known after apply)
22:06:07.829 STDOUT terraform1.13.3:       + self_link                                 = (known after apply)
22:06:07.829 STDOUT terraform1.13.3:     }
22:06:07.830 STDOUT terraform1.13.3:   # google_compute_subnetwork.subnet will be created
22:06:07.830 STDOUT terraform1.13.3:   + resource "google_compute_subnetwork" "subnet" {
22:06:07.830 STDOUT terraform1.13.3:       + creation_timestamp         = (known after apply)
22:06:07.831 STDOUT terraform1.13.3:       + external_ipv6_prefix       = (known after apply)
22:06:07.831 STDOUT terraform1.13.3:       + fingerprint                = (known after apply)
22:06:07.831 STDOUT terraform1.13.3:       + gateway_address            = (known after apply)
22:06:07.831 STDOUT terraform1.13.3:       + id                         = (known after apply)
22:06:07.831 STDOUT terraform1.13.3:       + internal_ipv6_prefix       = (known after apply)
22:06:07.831 STDOUT terraform1.13.3:       + ip_cidr_range              = "10.1.0.0/24"
22:06:07.831 STDOUT terraform1.13.3:       + ipv6_cidr_range            = (known after apply)
22:06:07.832 STDOUT terraform1.13.3:       + ipv6_gce_endpoint          = (known after apply)
22:06:07.832 STDOUT terraform1.13.3:       + name                       = "stg-vpc-australia-southeast2-subnet"
22:06:07.832 STDOUT terraform1.13.3:       + network                    = (known after apply)
22:06:07.832 STDOUT terraform1.13.3:       + private_ip_google_access   = (known after apply)
22:06:07.832 STDOUT terraform1.13.3:       + private_ipv6_google_access = (known after apply)
22:06:07.832 STDOUT terraform1.13.3:       + project                    = "iac-01"
22:06:07.832 STDOUT terraform1.13.3:       + purpose                    = (known after apply)
22:06:07.832 STDOUT terraform1.13.3:       + region                     = "australia-southeast2"
22:06:07.833 STDOUT terraform1.13.3:       + self_link                  = (known after apply)
22:06:07.833 STDOUT terraform1.13.3:       + stack_type                 = (known after apply)
22:06:07.833 STDOUT terraform1.13.3:       + state                      = (known after apply)
22:06:07.833 STDOUT terraform1.13.3:       + subnetwork_id              = (known after apply)
22:06:07.833 STDOUT terraform1.13.3:       + secondary_ip_range (known after apply)
22:06:07.833 STDOUT terraform1.13.3:     }
22:06:07.833 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
22:06:07.833 STDOUT terraform1.13.3: 
22:06:07.833 STDOUT terraform1.13.3: Changes to Outputs:
22:06:07.833 STDOUT terraform1.13.3:   + network_id        = (known after apply)
22:06:07.834 STDOUT terraform1.13.3:   + network_self_link = (known after apply)
22:06:07.834 STDOUT terraform1.13.3:   + subnet_self_link  = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/australia-southeast2/network -w nz3es_gcp_stg_data-plane_australia-southeast2_network
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Faustralia-southeast2%252Fnetwork%252Fnz3es_gcp_stg_data-plane_australia-southeast2_network)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/australia-southeast2/network -w nz3es_gcp_stg_data-plane_australia-southeast2_network
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 3. dir: `nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-example-com` workspace: `nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-example-com`
<details><summary>Show Output</summary>

```diff
Workspace directory /home/atlantis/data/repos/iac/7/nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-example-com does not exist yet, skipping cache cleanup

22:06:03.088 INFO   Downloading Terraform configurations from ../../../../../../../modules/dns into ./.terragrunt-cache/MeR3HbSejwvuF2NIiOaS0vjY3K8/10sLa2D-OkF_SKSTRhMdUEvcWLc
22:06:03.131 INFO   terraform1.13.3: Initializing the backend...
22:06:03.864 INFO   terraform1.13.3: 
22:06:03.864 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
22:06:03.864 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
22:06:04.138 INFO   terraform1.13.3: Initializing provider plugins...
22:06:04.138 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
22:06:04.344 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
22:06:04.663 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
22:06:04.663 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
22:06:04.663 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
22:06:04.663 INFO   terraform1.13.3: you run "terraform init" in the future.
22:06:04.663 INFO   terraform1.13.3: ╷
22:06:04.663 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
22:06:04.663 INFO   terraform1.13.3: │ 
22:06:04.663 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
22:06:04.663 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
22:06:04.663 INFO   terraform1.13.3: │   - hashicorp/google
22:06:04.663 INFO   terraform1.13.3: │ 
22:06:04.664 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
22:06:04.664 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
22:06:04.664 INFO   terraform1.13.3: │ these providers.
22:06:04.664 INFO   terraform1.13.3: │ 
22:06:04.664 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
22:06:04.664 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
22:06:04.664 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
22:06:04.664 INFO   terraform1.13.3: ╵
22:06:04.664 INFO   terraform1.13.3: Terraform has been successfully initialized!
22:06:07.845 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
22:06:07.845 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
22:06:07.845 STDOUT terraform1.13.3:   + create
22:06:07.845 STDOUT terraform1.13.3: Terraform will perform the following actions:
22:06:07.846 STDOUT terraform1.13.3:   # google_dns_managed_zone.dns_zone will be created
22:06:07.846 STDOUT terraform1.13.3:   + resource "google_dns_managed_zone" "dns_zone" {
22:06:07.846 STDOUT terraform1.13.3:       + creation_time    = (known after apply)
22:06:07.846 STDOUT terraform1.13.3:       + description      = "Public DNS zone nz3es.example.com. for stg environment"
22:06:07.846 STDOUT terraform1.13.3:       + dns_name         = "nz3es.example.com."
22:06:07.846 STDOUT terraform1.13.3:       + effective_labels = {
22:06:07.846 STDOUT terraform1.13.3:           + "environment"                = "stg"
22:06:07.847 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
22:06:07.847 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
22:06:07.847 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
22:06:07.847 STDOUT terraform1.13.3:           + "zone_type"                  = "public"
22:06:07.847 STDOUT terraform1.13.3:         }
22:06:07.847 STDOUT terraform1.13.3:       + force_destroy    = false
22:06:07.847 STDOUT terraform1.13.3:       + id               = (known after apply)
22:06:07.847 STDOUT terraform1.13.3:       + labels           = {
22:06:07.847 STDOUT terraform1.13.3:           + "environment" = "stg"
22:06:07.847 STDOUT terraform1.13.3:           + "managed_by"  = "terraform"
22:06:07.847 STDOUT terraform1.13.3:           + "region"      = "australia-southeast2"
22:06:07.848 STDOUT terraform1.13.3:           + "zone_type"   = "public"
22:06:07.848 STDOUT terraform1.13.3:         }
22:06:07.848 STDOUT terraform1.13.3:       + managed_zone_id  = (known after apply)
22:06:07.848 STDOUT terraform1.13.3:       + name             = "stg-nz3es-example-com-zone"
22:06:07.848 STDOUT terraform1.13.3:       + name_servers     = (known after apply)
22:06:07.848 STDOUT terraform1.13.3:       + project          = "iac-01"
22:06:07.848 STDOUT terraform1.13.3:       + terraform_labels = {
22:06:07.848 STDOUT terraform1.13.3:           + "environment"                = "stg"
22:06:07.848 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
22:06:07.848 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
22:06:07.848 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
22:06:07.849 STDOUT terraform1.13.3:           + "zone_type"                  = "public"
22:06:07.849 STDOUT terraform1.13.3:         }
22:06:07.849 STDOUT terraform1.13.3:       + visibility       = "public"
22:06:07.849 STDOUT terraform1.13.3:       + cloud_logging_config (known after apply)
22:06:07.849 STDOUT terraform1.13.3:       + dnssec_config (known after apply)
22:06:07.849 STDOUT terraform1.13.3:     }
22:06:07.849 STDOUT terraform1.13.3:   # google_dns_record_set.records["0"] will be created
22:06:07.849 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
22:06:07.849 STDOUT terraform1.13.3:       + id           = (known after apply)
22:06:07.849 STDOUT terraform1.13.3:       + managed_zone = "stg-nz3es-example-com-zone"
22:06:07.849 STDOUT terraform1.13.3:       + name         = "stg.nz3es.example.com."
22:06:07.849 STDOUT terraform1.13.3:       + project      = "iac-01"
22:06:07.850 STDOUT terraform1.13.3:       + rrdatas      = [
22:06:07.850 STDOUT terraform1.13.3:           + "10.1.0.10",
22:06:07.850 STDOUT terraform1.13.3:         ]
22:06:07.850 STDOUT terraform1.13.3:       + ttl          = 300
22:06:07.850 STDOUT terraform1.13.3:       + type         = "A"
22:06:07.850 STDOUT terraform1.13.3:     }
22:06:07.850 STDOUT terraform1.13.3:   # google_dns_record_set.records["1"] will be created
22:06:07.850 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
22:06:07.850 STDOUT terraform1.13.3:       + id           = (known after apply)
22:06:07.850 STDOUT terraform1.13.3:       + managed_zone = "stg-nz3es-example-com-zone"
22:06:07.850 STDOUT terraform1.13.3:       + name         = "app.stg.nz3es.example.com."
22:06:07.850 STDOUT terraform1.13.3:       + project      = "iac-01"
22:06:07.851 STDOUT terraform1.13.3:       + rrdatas      = [
22:06:07.851 STDOUT terraform1.13.3:           + "10.1.0.20",
22:06:07.851 STDOUT terraform1.13.3:         ]
22:06:07.851 STDOUT terraform1.13.3:       + ttl          = 300
22:06:07.851 STDOUT terraform1.13.3:       + type         = "A"
22:06:07.851 STDOUT terraform1.13.3:     }
22:06:07.851 STDOUT terraform1.13.3:   # google_dns_record_set.records["2"] will be created
22:06:07.851 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
22:06:07.851 STDOUT terraform1.13.3:       + id           = (known after apply)
22:06:07.851 STDOUT terraform1.13.3:       + managed_zone = "stg-nz3es-example-com-zone"
22:06:07.851 STDOUT terraform1.13.3:       + name         = "www.stg.nz3es.example.com."
22:06:07.851 STDOUT terraform1.13.3:       + project      = "iac-01"
22:06:07.851 STDOUT terraform1.13.3:       + rrdatas      = [
22:06:07.851 STDOUT terraform1.13.3:           + "app.stg.nz3es.example.com.",
22:06:07.851 STDOUT terraform1.13.3:         ]
22:06:07.851 STDOUT terraform1.13.3:       + ttl          = 300
22:06:07.852 STDOUT terraform1.13.3:       + type         = "CNAME"
22:06:07.852 STDOUT terraform1.13.3:     }
22:06:07.852 STDOUT terraform1.13.3: Plan: 4 to add, 0 to change, 0 to destroy.
22:06:07.852 STDOUT terraform1.13.3: 
22:06:07.852 STDOUT terraform1.13.3: Changes to Outputs:
22:06:07.852 STDOUT terraform1.13.3:   + dns_name     = "nz3es.example.com."
22:06:07.852 STDOUT terraform1.13.3:   + name_servers = (known after apply)
22:06:07.852 STDOUT terraform1.13.3:   + recordsets   = {
22:06:07.852 STDOUT terraform1.13.3:       + "0" = {
22:06:07.852 STDOUT terraform1.13.3:           + name    = "stg.nz3es.example.com."
22:06:07.852 STDOUT terraform1.13.3:           + rrdatas = [
22:06:07.852 STDOUT terraform1.13.3:               + "10.1.0.10",
22:06:07.852 STDOUT terraform1.13.3:             ]
22:06:07.852 STDOUT terraform1.13.3:           + ttl     = 300
22:06:07.852 STDOUT terraform1.13.3:           + type    = "A"
22:06:07.852 STDOUT terraform1.13.3:         }
22:06:07.852 STDOUT terraform1.13.3:       + "1" = {
22:06:07.853 STDOUT terraform1.13.3:           + name    = "app.stg.nz3es.example.com."
22:06:07.853 STDOUT terraform1.13.3:           + rrdatas = [
22:06:07.853 STDOUT terraform1.13.3:               + "10.1.0.20",
22:06:07.853 STDOUT terraform1.13.3:             ]
22:06:07.853 STDOUT terraform1.13.3:           + ttl     = 300
22:06:07.853 STDOUT terraform1.13.3:           + type    = "A"
22:06:07.853 STDOUT terraform1.13.3:         }
22:06:07.853 STDOUT terraform1.13.3:       + "2" = {
22:06:07.853 STDOUT terraform1.13.3:           + name    = "www.stg.nz3es.example.com."
22:06:07.853 STDOUT terraform1.13.3:           + rrdatas = [
22:06:07.853 STDOUT terraform1.13.3:               + "app.stg.nz3es.example.com.",
22:06:07.853 STDOUT terraform1.13.3:             ]
22:06:07.853 STDOUT terraform1.13.3:           + ttl     = 300
22:06:07.853 STDOUT terraform1.13.3:           + type    = "CNAME"
22:06:07.854 STDOUT terraform1.13.3:         }
22:06:07.854 STDOUT terraform1.13.3:     }
22:06:07.854 STDOUT terraform1.13.3:   + zone_id      = (known after apply)
22:06:07.854 STDOUT terraform1.13.3:   + zone_name    = "stg-nz3es-example-com-zone"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-example-com -w nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-example-com
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Faustralia-southeast2%252Fdns-zone%252Fnz3es-example-com%252Fnz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-example-com)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-example-com -w nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-example-com
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 4. dir: `nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-example-com` workspace: `nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-example-com`
<details><summary>Show Output</summary>

```diff
Workspace directory /home/atlantis/data/repos/iac/7/nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-example-com does not exist yet, skipping cache cleanup

22:06:02.788 INFO   Downloading Terraform configurations from ../../../../../../../modules/dns into ./.terragrunt-cache/ina_H5lCBDkwntAIXO_a3M2wxmo/5QIdrCGQkDiYl5ADnXqLOtCjVZ0
22:06:02.845 INFO   terraform1.13.3: Initializing the backend...
22:06:03.758 INFO   terraform1.13.3: 
22:06:03.758 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
22:06:03.758 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
22:06:04.054 INFO   terraform1.13.3: Initializing provider plugins...
22:06:04.054 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
22:06:04.342 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
22:06:04.663 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
22:06:04.663 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
22:06:04.663 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
22:06:04.663 INFO   terraform1.13.3: you run "terraform init" in the future.
22:06:04.663 INFO   terraform1.13.3: ╷
22:06:04.663 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
22:06:04.663 INFO   terraform1.13.3: │ 
22:06:04.663 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
22:06:04.664 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
22:06:04.664 INFO   terraform1.13.3: │   - hashicorp/google
22:06:04.664 INFO   terraform1.13.3: │ 
22:06:04.664 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
22:06:04.664 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
22:06:04.664 INFO   terraform1.13.3: │ these providers.
22:06:04.664 INFO   terraform1.13.3: │ 
22:06:04.664 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
22:06:04.664 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
22:06:04.664 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
22:06:04.664 INFO   terraform1.13.3: ╵
22:06:04.664 INFO   terraform1.13.3: Terraform has been successfully initialized!
22:06:07.851 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
22:06:07.851 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
22:06:07.851 STDOUT terraform1.13.3:   + create
22:06:07.851 STDOUT terraform1.13.3: Terraform will perform the following actions:
22:06:07.851 STDOUT terraform1.13.3:   # google_dns_managed_zone.dns_zone will be created
22:06:07.851 STDOUT terraform1.13.3:   + resource "google_dns_managed_zone" "dns_zone" {
22:06:07.852 STDOUT terraform1.13.3:       + creation_time    = (known after apply)
22:06:07.852 STDOUT terraform1.13.3:       + description      = "Public DNS zone nz3es.example.com. for prd environment"
22:06:07.852 STDOUT terraform1.13.3:       + dns_name         = "nz3es.example.com."
22:06:07.852 STDOUT terraform1.13.3:       + effective_labels = {
22:06:07.852 STDOUT terraform1.13.3:           + "environment"                = "prd"
22:06:07.852 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
22:06:07.852 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
22:06:07.853 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
22:06:07.853 STDOUT terraform1.13.3:           + "zone_type"                  = "public"
22:06:07.853 STDOUT terraform1.13.3:         }
22:06:07.853 STDOUT terraform1.13.3:       + force_destroy    = false
22:06:07.853 STDOUT terraform1.13.3:       + id               = (known after apply)
22:06:07.853 STDOUT terraform1.13.3:       + labels           = {
22:06:07.853 STDOUT terraform1.13.3:           + "environment" = "prd"
22:06:07.853 STDOUT terraform1.13.3:           + "managed_by"  = "terraform"
22:06:07.853 STDOUT terraform1.13.3:           + "region"      = "australia-southeast2"
22:06:07.853 STDOUT terraform1.13.3:           + "zone_type"   = "public"
22:06:07.854 STDOUT terraform1.13.3:         }
22:06:07.854 STDOUT terraform1.13.3:       + managed_zone_id  = (known after apply)
22:06:07.854 STDOUT terraform1.13.3:       + name             = "prd-nz3es-example-com-zone"
22:06:07.854 STDOUT terraform1.13.3:       + name_servers     = (known after apply)
22:06:07.854 STDOUT terraform1.13.3:       + project          = "iac-01"
22:06:07.854 STDOUT terraform1.13.3:       + terraform_labels = {
22:06:07.854 STDOUT terraform1.13.3:           + "environment"                = "prd"
22:06:07.854 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
22:06:07.854 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
22:06:07.854 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
22:06:07.854 STDOUT terraform1.13.3:           + "zone_type"                  = "public"
22:06:07.855 STDOUT terraform1.13.3:         }
22:06:07.855 STDOUT terraform1.13.3:       + visibility       = "public"
22:06:07.855 STDOUT terraform1.13.3:       + cloud_logging_config (known after apply)
22:06:07.855 STDOUT terraform1.13.3:       + dnssec_config (known after apply)
22:06:07.855 STDOUT terraform1.13.3:     }
22:06:07.855 STDOUT terraform1.13.3:   # google_dns_record_set.records["0"] will be created
22:06:07.855 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
22:06:07.855 STDOUT terraform1.13.3:       + id           = (known after apply)
22:06:07.855 STDOUT terraform1.13.3:       + managed_zone = "prd-nz3es-example-com-zone"
22:06:07.855 STDOUT terraform1.13.3:       + name         = "nz3es.example.com."
22:06:07.855 STDOUT terraform1.13.3:       + project      = "iac-01"
22:06:07.855 STDOUT terraform1.13.3:       + rrdatas      = [
22:06:07.856 STDOUT terraform1.13.3:           + "10.0.0.10",
22:06:07.856 STDOUT terraform1.13.3:         ]
22:06:07.856 STDOUT terraform1.13.3:       + ttl          = 300
22:06:07.856 STDOUT terraform1.13.3:       + type         = "A"
22:06:07.856 STDOUT terraform1.13.3:     }
22:06:07.856 STDOUT terraform1.13.3:   # google_dns_record_set.records["1"] will be created
22:06:07.856 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
22:06:07.856 STDOUT terraform1.13.3:       + id           = (known after apply)
22:06:07.856 STDOUT terraform1.13.3:       + managed_zone = "prd-nz3es-example-com-zone"
22:06:07.856 STDOUT terraform1.13.3:       + name         = "app.nz3es.example.com."
22:06:07.856 STDOUT terraform1.13.3:       + project      = "iac-01"
22:06:07.856 STDOUT terraform1.13.3:       + rrdatas      = [
22:06:07.856 STDOUT terraform1.13.3:           + "10.0.0.20",
22:06:07.857 STDOUT terraform1.13.3:         ]
22:06:07.857 STDOUT terraform1.13.3:       + ttl          = 300
22:06:07.857 STDOUT terraform1.13.3:       + type         = "A"
22:06:07.857 STDOUT terraform1.13.3:     }
22:06:07.857 STDOUT terraform1.13.3:   # google_dns_record_set.records["2"] will be created
22:06:07.857 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
22:06:07.857 STDOUT terraform1.13.3:       + id           = (known after apply)
22:06:07.857 STDOUT terraform1.13.3:       + managed_zone = "prd-nz3es-example-com-zone"
22:06:07.857 STDOUT terraform1.13.3:       + name         = "www.nz3es.example.com."
22:06:07.857 STDOUT terraform1.13.3:       + project      = "iac-01"
22:06:07.857 STDOUT terraform1.13.3:       + rrdatas      = [
22:06:07.857 STDOUT terraform1.13.3:           + "app.nz3es.example.com.",
22:06:07.857 STDOUT terraform1.13.3:         ]
22:06:07.857 STDOUT terraform1.13.3:       + ttl          = 300
22:06:07.858 STDOUT terraform1.13.3:       + type         = "CNAME"
22:06:07.858 STDOUT terraform1.13.3:     }
22:06:07.858 STDOUT terraform1.13.3: Plan: 4 to add, 0 to change, 0 to destroy.
22:06:07.858 STDOUT terraform1.13.3: 
22:06:07.858 STDOUT terraform1.13.3: Changes to Outputs:
22:06:07.858 STDOUT terraform1.13.3:   + dns_name     = "nz3es.example.com."
22:06:07.858 STDOUT terraform1.13.3:   + name_servers = (known after apply)
22:06:07.858 STDOUT terraform1.13.3:   + recordsets   = {
22:06:07.858 STDOUT terraform1.13.3:       + "0" = {
22:06:07.858 STDOUT terraform1.13.3:           + name    = "nz3es.example.com."
22:06:07.858 STDOUT terraform1.13.3:           + rrdatas = [
22:06:07.858 STDOUT terraform1.13.3:               + "10.0.0.10",
22:06:07.858 STDOUT terraform1.13.3:             ]
22:06:07.858 STDOUT terraform1.13.3:           + ttl     = 300
22:06:07.858 STDOUT terraform1.13.3:           + type    = "A"
22:06:07.858 STDOUT terraform1.13.3:         }
22:06:07.858 STDOUT terraform1.13.3:       + "1" = {
22:06:07.858 STDOUT terraform1.13.3:           + name    = "app.nz3es.example.com."
22:06:07.859 STDOUT terraform1.13.3:           + rrdatas = [
22:06:07.859 STDOUT terraform1.13.3:               + "10.0.0.20",
22:06:07.859 STDOUT terraform1.13.3:             ]
22:06:07.859 STDOUT terraform1.13.3:           + ttl     = 300
22:06:07.859 STDOUT terraform1.13.3:           + type    = "A"
22:06:07.859 STDOUT terraform1.13.3:         }
22:06:07.859 STDOUT terraform1.13.3:       + "2" = {
22:06:07.859 STDOUT terraform1.13.3:           + name    = "www.nz3es.example.com."
22:06:07.859 STDOUT terraform1.13.3:           + rrdatas = [
22:06:07.859 STDOUT terraform1.13.3:               + "app.nz3es.example.com.",
22:06:07.859 STDOUT terraform1.13.3:             ]
22:06:07.859 STDOUT terraform1.13.3:           + ttl     = 300
22:06:07.859 STDOUT terraform1.13.3:           + type    = "CNAME"
22:06:07.859 STDOUT terraform1.13.3:         }
22:06:07.859 STDOUT terraform1.13.3:     }
22:06:07.859 STDOUT terraform1.13.3:   + zone_id      = (known after apply)
22:06:07.859 STDOUT terraform1.13.3:   + zone_name    = "prd-nz3es-example-com-zone"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-example-com -w nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-example-com
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fprd%252Fdata-plane%252Faustralia-southeast2%252Fdns-zone%252Fnz3es-example-com%252Fnz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-example-com)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-example-com -w nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-example-com
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 5. dir: `nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-internal` workspace: `nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-internal`
<details><summary>Show Output</summary>

```diff
Workspace directory /home/atlantis/data/repos/iac/7/nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-internal does not exist yet, skipping cache cleanup

22:06:12.215 WARN   Config ../../network/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
22:06:12.222 INFO   Downloading Terraform configurations from ../../../../../../../modules/dns into ./.terragrunt-cache/pghn42eq9mVghWb-KfydW4cMi24/XXIgfNv1mqfKu_j3nJZNp0IkX8c
22:06:12.264 INFO   terraform1.13.3: Initializing the backend...
22:06:12.981 INFO   terraform1.13.3: 
22:06:12.981 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
22:06:12.982 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
22:06:13.270 INFO   terraform1.13.3: Initializing provider plugins...
22:06:13.270 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
22:06:13.478 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
22:06:13.800 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
22:06:13.800 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
22:06:13.800 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
22:06:13.801 INFO   terraform1.13.3: you run "terraform init" in the future.
22:06:13.801 INFO   terraform1.13.3: ╷
22:06:13.801 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
22:06:13.801 INFO   terraform1.13.3: │ 
22:06:13.801 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
22:06:13.801 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
22:06:13.801 INFO   terraform1.13.3: │   - hashicorp/google
22:06:13.801 INFO   terraform1.13.3: │ 
22:06:13.801 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
22:06:13.801 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
22:06:13.801 INFO   terraform1.13.3: │ these providers.
22:06:13.801 INFO   terraform1.13.3: │ 
22:06:13.801 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
22:06:13.801 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
22:06:13.802 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
22:06:13.802 INFO   terraform1.13.3: ╵
22:06:13.802 INFO   terraform1.13.3: Terraform has been successfully initialized!
22:06:16.553 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
22:06:16.553 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
22:06:16.553 STDOUT terraform1.13.3:   + create
22:06:16.553 STDOUT terraform1.13.3: Terraform will perform the following actions:
22:06:16.553 STDOUT terraform1.13.3:   # google_dns_managed_zone.dns_zone will be created
22:06:16.553 STDOUT terraform1.13.3:   + resource "google_dns_managed_zone" "dns_zone" {
22:06:16.554 STDOUT terraform1.13.3:       + creation_time    = (known after apply)
22:06:16.554 STDOUT terraform1.13.3:       + description      = "Internal DNS zone nz3es.internal. for stg environment"
22:06:16.554 STDOUT terraform1.13.3:       + dns_name         = "nz3es.internal."
22:06:16.554 STDOUT terraform1.13.3:       + effective_labels = {
22:06:16.554 STDOUT terraform1.13.3:           + "environment"                = "stg"
22:06:16.554 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
22:06:16.554 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
22:06:16.554 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
22:06:16.555 STDOUT terraform1.13.3:           + "zone_type"                  = "internal"
22:06:16.555 STDOUT terraform1.13.3:         }
22:06:16.555 STDOUT terraform1.13.3:       + force_destroy    = false
22:06:16.555 STDOUT terraform1.13.3:       + id               = (known after apply)
22:06:16.555 STDOUT terraform1.13.3:       + labels           = {
22:06:16.555 STDOUT terraform1.13.3:           + "environment" = "stg"
22:06:16.555 STDOUT terraform1.13.3:           + "managed_by"  = "terraform"
22:06:16.555 STDOUT terraform1.13.3:           + "region"      = "australia-southeast2"
22:06:16.555 STDOUT terraform1.13.3:           + "zone_type"   = "internal"
22:06:16.556 STDOUT terraform1.13.3:         }
22:06:16.556 STDOUT terraform1.13.3:       + managed_zone_id  = (known after apply)
22:06:16.556 STDOUT terraform1.13.3:       + name             = "stg-nz3es-internal-zone"
22:06:16.556 STDOUT terraform1.13.3:       + name_servers     = (known after apply)
22:06:16.556 STDOUT terraform1.13.3:       + project          = "iac-01"
22:06:16.556 STDOUT terraform1.13.3:       + terraform_labels = {
22:06:16.556 STDOUT terraform1.13.3:           + "environment"                = "stg"
22:06:16.556 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
22:06:16.556 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
22:06:16.556 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
22:06:16.557 STDOUT terraform1.13.3:           + "zone_type"                  = "internal"
22:06:16.557 STDOUT terraform1.13.3:         }
22:06:16.557 STDOUT terraform1.13.3:       + visibility       = "private"
22:06:16.557 STDOUT terraform1.13.3:       + cloud_logging_config (known after apply)
22:06:16.557 STDOUT terraform1.13.3:       + dnssec_config (known after apply)
22:06:16.557 STDOUT terraform1.13.3:       + private_visibility_config {
22:06:16.557 STDOUT terraform1.13.3:           + networks {
22:06:16.557 STDOUT terraform1.13.3:               + network_url = "https://www.googleapis.com/compute/v1/projects/mock-project/global/networks/mock-network"
22:06:16.557 STDOUT terraform1.13.3:             }
22:06:16.557 STDOUT terraform1.13.3:         }
22:06:16.557 STDOUT terraform1.13.3:     }
22:06:16.557 STDOUT terraform1.13.3:   # google_dns_record_set.records["0"] will be created
22:06:16.557 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
22:06:16.558 STDOUT terraform1.13.3:       + id           = (known after apply)
22:06:16.558 STDOUT terraform1.13.3:       + managed_zone = "stg-nz3es-internal-zone"
22:06:16.558 STDOUT terraform1.13.3:       + name         = "db.stg.nz3es.internal."
22:06:16.558 STDOUT terraform1.13.3:       + project      = "iac-01"
22:06:16.558 STDOUT terraform1.13.3:       + rrdatas      = [
22:06:16.558 STDOUT terraform1.13.3:           + "10.1.0.100",
22:06:16.558 STDOUT terraform1.13.3:         ]
22:06:16.558 STDOUT terraform1.13.3:       + ttl          = 300
22:06:16.558 STDOUT terraform1.13.3:       + type         = "A"
22:06:16.558 STDOUT terraform1.13.3:     }
22:06:16.558 STDOUT terraform1.13.3:   # google_dns_record_set.records["1"] will be created
22:06:16.558 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
22:06:16.559 STDOUT terraform1.13.3:       + id           = (known after apply)
22:06:16.559 STDOUT terraform1.13.3:       + managed_zone = "stg-nz3es-internal-zone"
22:06:16.559 STDOUT terraform1.13.3:       + name         = "cache.stg.nz3es.internal."
22:06:16.559 STDOUT terraform1.13.3:       + project      = "iac-01"
22:06:16.559 STDOUT terraform1.13.3:       + rrdatas      = [
22:06:16.559 STDOUT terraform1.13.3:           + "10.1.0.101",
22:06:16.559 STDOUT terraform1.13.3:         ]
22:06:16.559 STDOUT terraform1.13.3:       + ttl          = 300
22:06:16.559 STDOUT terraform1.13.3:       + type         = "A"
22:06:16.559 STDOUT terraform1.13.3:     }
22:06:16.559 STDOUT terraform1.13.3:   # google_dns_record_set.records["2"] will be created
22:06:16.559 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
22:06:16.559 STDOUT terraform1.13.3:       + id           = (known after apply)
22:06:16.560 STDOUT terraform1.13.3:       + managed_zone = "stg-nz3es-internal-zone"
22:06:16.560 STDOUT terraform1.13.3:       + name         = "api.stg.nz3es.internal."
22:06:16.560 STDOUT terraform1.13.3:       + project      = "iac-01"
22:06:16.560 STDOUT terraform1.13.3:       + rrdatas      = [
22:06:16.560 STDOUT terraform1.13.3:           + "10.1.0.102",
22:06:16.560 STDOUT terraform1.13.3:         ]
22:06:16.560 STDOUT terraform1.13.3:       + ttl          = 300
22:06:16.560 STDOUT terraform1.13.3:       + type         = "A"
22:06:16.560 STDOUT terraform1.13.3:     }
22:06:16.560 STDOUT terraform1.13.3: Plan: 4 to add, 0 to change, 0 to destroy.
22:06:16.560 STDOUT terraform1.13.3: 
22:06:16.560 STDOUT terraform1.13.3: Changes to Outputs:
22:06:16.560 STDOUT terraform1.13.3:   + dns_name     = "nz3es.internal."
22:06:16.560 STDOUT terraform1.13.3:   + name_servers = (known after apply)
22:06:16.561 STDOUT terraform1.13.3:   + recordsets   = {
22:06:16.561 STDOUT terraform1.13.3:       + "0" = {
22:06:16.561 STDOUT terraform1.13.3:           + name    = "db.stg.nz3es.internal."
22:06:16.561 STDOUT terraform1.13.3:           + rrdatas = [
22:06:16.561 STDOUT terraform1.13.3:               + "10.1.0.100",
22:06:16.561 STDOUT terraform1.13.3:             ]
22:06:16.561 STDOUT terraform1.13.3:           + ttl     = 300
22:06:16.561 STDOUT terraform1.13.3:           + type    = "A"
22:06:16.561 STDOUT terraform1.13.3:         }
22:06:16.561 STDOUT terraform1.13.3:       + "1" = {
22:06:16.561 STDOUT terraform1.13.3:           + name    = "cache.stg.nz3es.internal."
22:06:16.561 STDOUT terraform1.13.3:           + rrdatas = [
22:06:16.561 STDOUT terraform1.13.3:               + "10.1.0.101",
22:06:16.561 STDOUT terraform1.13.3:             ]
22:06:16.561 STDOUT terraform1.13.3:           + ttl     = 300
22:06:16.561 STDOUT terraform1.13.3:           + type    = "A"
22:06:16.562 STDOUT terraform1.13.3:         }
22:06:16.562 STDOUT terraform1.13.3:       + "2" = {
22:06:16.562 STDOUT terraform1.13.3:           + name    = "api.stg.nz3es.internal."
22:06:16.562 STDOUT terraform1.13.3:           + rrdatas = [
22:06:16.562 STDOUT terraform1.13.3:               + "10.1.0.102",
22:06:16.562 STDOUT terraform1.13.3:             ]
22:06:16.562 STDOUT terraform1.13.3:           + ttl     = 300
22:06:16.562 STDOUT terraform1.13.3:           + type    = "A"
22:06:16.562 STDOUT terraform1.13.3:         }
22:06:16.562 STDOUT terraform1.13.3:     }
22:06:16.562 STDOUT terraform1.13.3:   + zone_id      = (known after apply)
22:06:16.562 STDOUT terraform1.13.3:   + zone_name    = "stg-nz3es-internal-zone"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-internal -w nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-internal
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Faustralia-southeast2%252Fdns-zone%252Fnz3es-internal%252Fnz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-internal)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/australia-southeast2/dns-zone/nz3es-internal -w nz3es_gcp_stg_data-plane_australia-southeast2_dns-zone_nz3es-internal
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 6. dir: `nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-internal` workspace: `nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-internal`
<details><summary>Show Output</summary>

```diff
Workspace directory /home/atlantis/data/repos/iac/7/nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-internal does not exist yet, skipping cache cleanup

22:06:12.145 WARN   Config ../../network/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
22:06:12.155 INFO   Downloading Terraform configurations from ../../../../../../../modules/dns into ./.terragrunt-cache/CJ7d1J0dEUk-K-JqFqKmgxMsKFg/APTP6Ss3Trw7g1qea-CR4YLYmH0
22:06:12.201 INFO   terraform1.13.3: Initializing the backend...
22:06:12.937 INFO   terraform1.13.3: 
22:06:12.937 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
22:06:12.937 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
22:06:13.246 INFO   terraform1.13.3: Initializing provider plugins...
22:06:13.247 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 4.0.0"...
22:06:13.457 INFO   terraform1.13.3: - Using hashicorp/google v7.15.0 from the shared cache directory
22:06:13.783 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
22:06:13.783 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
22:06:13.784 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
22:06:13.784 INFO   terraform1.13.3: you run "terraform init" in the future.
22:06:13.784 INFO   terraform1.13.3: ╷
22:06:13.784 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
22:06:13.784 INFO   terraform1.13.3: │ 
22:06:13.784 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
22:06:13.784 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
22:06:13.784 INFO   terraform1.13.3: │   - hashicorp/google
22:06:13.785 INFO   terraform1.13.3: │ 
22:06:13.785 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
22:06:13.785 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
22:06:13.785 INFO   terraform1.13.3: │ these providers.
22:06:13.785 INFO   terraform1.13.3: │ 
22:06:13.785 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
22:06:13.785 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
22:06:13.785 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
22:06:13.785 INFO   terraform1.13.3: ╵
22:06:13.785 INFO   terraform1.13.3: Terraform has been successfully initialized!
22:06:16.550 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
22:06:16.550 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
22:06:16.550 STDOUT terraform1.13.3:   + create
22:06:16.551 STDOUT terraform1.13.3: Terraform will perform the following actions:
22:06:16.551 STDOUT terraform1.13.3:   # google_dns_managed_zone.dns_zone will be created
22:06:16.551 STDOUT terraform1.13.3:   + resource "google_dns_managed_zone" "dns_zone" {
22:06:16.551 STDOUT terraform1.13.3:       + creation_time    = (known after apply)
22:06:16.551 STDOUT terraform1.13.3:       + description      = "Internal DNS zone nz3es.internal. for prd environment"
22:06:16.551 STDOUT terraform1.13.3:       + dns_name         = "nz3es.internal."
22:06:16.551 STDOUT terraform1.13.3:       + effective_labels = {
22:06:16.551 STDOUT terraform1.13.3:           + "environment"                = "prd"
22:06:16.551 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
22:06:16.552 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
22:06:16.552 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
22:06:16.552 STDOUT terraform1.13.3:           + "zone_type"                  = "internal"
22:06:16.552 STDOUT terraform1.13.3:         }
22:06:16.552 STDOUT terraform1.13.3:       + force_destroy    = false
22:06:16.552 STDOUT terraform1.13.3:       + id               = (known after apply)
22:06:16.552 STDOUT terraform1.13.3:       + labels           = {
22:06:16.552 STDOUT terraform1.13.3:           + "environment" = "prd"
22:06:16.552 STDOUT terraform1.13.3:           + "managed_by"  = "terraform"
22:06:16.553 STDOUT terraform1.13.3:           + "region"      = "australia-southeast2"
22:06:16.553 STDOUT terraform1.13.3:           + "zone_type"   = "internal"
22:06:16.553 STDOUT terraform1.13.3:         }
22:06:16.553 STDOUT terraform1.13.3:       + managed_zone_id  = (known after apply)
22:06:16.553 STDOUT terraform1.13.3:       + name             = "prd-nz3es-internal-zone"
22:06:16.553 STDOUT terraform1.13.3:       + name_servers     = (known after apply)
22:06:16.553 STDOUT terraform1.13.3:       + project          = "iac-01"
22:06:16.553 STDOUT terraform1.13.3:       + terraform_labels = {
22:06:16.553 STDOUT terraform1.13.3:           + "environment"                = "prd"
22:06:16.554 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
22:06:16.554 STDOUT terraform1.13.3:           + "managed_by"                 = "terraform"
22:06:16.554 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
22:06:16.554 STDOUT terraform1.13.3:           + "zone_type"                  = "internal"
22:06:16.554 STDOUT terraform1.13.3:         }
22:06:16.554 STDOUT terraform1.13.3:       + visibility       = "private"
22:06:16.554 STDOUT terraform1.13.3:       + cloud_logging_config (known after apply)
22:06:16.554 STDOUT terraform1.13.3:       + dnssec_config (known after apply)
22:06:16.554 STDOUT terraform1.13.3:       + private_visibility_config {
22:06:16.554 STDOUT terraform1.13.3:           + networks {
22:06:16.554 STDOUT terraform1.13.3:               + network_url = "https://www.googleapis.com/compute/v1/projects/mock-project/global/networks/mock-network"
22:06:16.555 STDOUT terraform1.13.3:             }
22:06:16.555 STDOUT terraform1.13.3:         }
22:06:16.555 STDOUT terraform1.13.3:     }
22:06:16.555 STDOUT terraform1.13.3:   # google_dns_record_set.records["0"] will be created
22:06:16.555 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
22:06:16.555 STDOUT terraform1.13.3:       + id           = (known after apply)
22:06:16.555 STDOUT terraform1.13.3:       + managed_zone = "prd-nz3es-internal-zone"
22:06:16.555 STDOUT terraform1.13.3:       + name         = "db.nz3es.internal."
22:06:16.556 STDOUT terraform1.13.3:       + project      = "iac-01"
22:06:16.556 STDOUT terraform1.13.3:       + rrdatas      = [
22:06:16.556 STDOUT terraform1.13.3:           + "10.0.0.100",
22:06:16.556 STDOUT terraform1.13.3:         ]
22:06:16.556 STDOUT terraform1.13.3:       + ttl          = 300
22:06:16.556 STDOUT terraform1.13.3:       + type         = "A"
22:06:16.556 STDOUT terraform1.13.3:     }
22:06:16.556 STDOUT terraform1.13.3:   # google_dns_record_set.records["1"] will be created
22:06:16.556 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
22:06:16.556 STDOUT terraform1.13.3:       + id           = (known after apply)
22:06:16.556 STDOUT terraform1.13.3:       + managed_zone = "prd-nz3es-internal-zone"
22:06:16.556 STDOUT terraform1.13.3:       + name         = "cache.nz3es.internal."
22:06:16.556 STDOUT terraform1.13.3:       + project      = "iac-01"
22:06:16.557 STDOUT terraform1.13.3:       + rrdatas      = [
22:06:16.557 STDOUT terraform1.13.3:           + "10.0.0.101",
22:06:16.557 STDOUT terraform1.13.3:         ]
22:06:16.557 STDOUT terraform1.13.3:       + ttl          = 300
22:06:16.557 STDOUT terraform1.13.3:       + type         = "A"
22:06:16.557 STDOUT terraform1.13.3:     }
22:06:16.557 STDOUT terraform1.13.3:   # google_dns_record_set.records["2"] will be created
22:06:16.557 STDOUT terraform1.13.3:   + resource "google_dns_record_set" "records" {
22:06:16.557 STDOUT terraform1.13.3:       + id           = (known after apply)
22:06:16.557 STDOUT terraform1.13.3:       + managed_zone = "prd-nz3es-internal-zone"
22:06:16.557 STDOUT terraform1.13.3:       + name         = "api.nz3es.internal."
22:06:16.557 STDOUT terraform1.13.3:       + project      = "iac-01"
22:06:16.557 STDOUT terraform1.13.3:       + rrdatas      = [
22:06:16.557 STDOUT terraform1.13.3:           + "10.0.0.102",
22:06:16.557 STDOUT terraform1.13.3:         ]
22:06:16.557 STDOUT terraform1.13.3:       + ttl          = 300
22:06:16.557 STDOUT terraform1.13.3:       + type         = "A"
22:06:16.558 STDOUT terraform1.13.3:     }
22:06:16.558 STDOUT terraform1.13.3: Plan: 4 to add, 0 to change, 0 to destroy.
22:06:16.558 STDOUT terraform1.13.3: 
22:06:16.558 STDOUT terraform1.13.3: Changes to Outputs:
22:06:16.558 STDOUT terraform1.13.3:   + dns_name     = "nz3es.internal."
22:06:16.558 STDOUT terraform1.13.3:   + name_servers = (known after apply)
22:06:16.558 STDOUT terraform1.13.3:   + recordsets   = {
22:06:16.558 STDOUT terraform1.13.3:       + "0" = {
22:06:16.558 STDOUT terraform1.13.3:           + name    = "db.nz3es.internal."
22:06:16.558 STDOUT terraform1.13.3:           + rrdatas = [
22:06:16.558 STDOUT terraform1.13.3:               + "10.0.0.100",
22:06:16.558 STDOUT terraform1.13.3:             ]
22:06:16.558 STDOUT terraform1.13.3:           + ttl     = 300
22:06:16.558 STDOUT terraform1.13.3:           + type    = "A"
22:06:16.558 STDOUT terraform1.13.3:         }
22:06:16.558 STDOUT terraform1.13.3:       + "1" = {
22:06:16.558 STDOUT terraform1.13.3:           + name    = "cache.nz3es.internal."
22:06:16.558 STDOUT terraform1.13.3:           + rrdatas = [
22:06:16.558 STDOUT terraform1.13.3:               + "10.0.0.101",
22:06:16.559 STDOUT terraform1.13.3:             ]
22:06:16.559 STDOUT terraform1.13.3:           + ttl     = 300
22:06:16.559 STDOUT terraform1.13.3:           + type    = "A"
22:06:16.559 STDOUT terraform1.13.3:         }
22:06:16.559 STDOUT terraform1.13.3:       + "2" = {
22:06:16.559 STDOUT terraform1.13.3:           + name    = "api.nz3es.internal."
22:06:16.559 STDOUT terraform1.13.3:           + rrdatas = [
22:06:16.559 STDOUT terraform1.13.3:               + "10.0.0.102",
22:06:16.559 STDOUT terraform1.13.3:             ]
22:06:16.559 STDOUT terraform1.13.3:           + ttl     = 300
22:06:16.559 STDOUT terraform1.13.3:           + type    = "A"
22:06:16.559 STDOUT terraform1.13.3:         }
22:06:16.559 STDOUT terraform1.13.3:     }
22:06:16.559 STDOUT terraform1.13.3:   + zone_id      = (known after apply)
22:06:16.559 STDOUT terraform1.13.3:   + zone_name    = "prd-nz3es-internal-zone"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-internal -w nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-internal
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Fiac%252Fnz3es%252Fgcp%252Fprd%252Fdata-plane%252Faustralia-southeast2%252Fdns-zone%252Fnz3es-internal%252Fnz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-internal)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/prd/data-plane/australia-southeast2/dns-zone/nz3es-internal -w nz3es_gcp_prd_data-plane_australia-southeast2_dns-zone_nz3es-internal
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### Plan Summary

6 projects, 6 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```